#include <stdio.h>
// 전처리기 : 프로그램에서 사용 할 명령어를 정의해 놓은 파일을 불러오는 것
int main() { // 메인 함수 시작
	// annotation
	// - 소스 코드안에 어떤 코멘트를 달아줄때 사용
	// - 프로그램 실행에 영향을 주지 않는다
	// 슬래쉬 두번 : 한줄 주석
	/*	슬래쉬 별 : 여러 줄 주석의 시작
	
	이안에 모든 내용이 주석 처리 됩니다..

	별 슬래쉬 : 여러 줄 주석의 종료*/

	printf("쌍따옴표 안에 출력 할 내용을 작성하세요..");
	// 컴파일 (compile) : Ctrl + F7
	// - 프로그래밍 언어로 작성한 내용을 컴퓨터가 이해하는 기계어로 변환하는 과정

	// 링커( linker ) 
	// - 컴파일 되어 나온 오브젝트파일(.obj) 과 헤더파일을 연결해서 실행파일(.exe)을 만드는 과정
	
	// 빌드( build ) : F7 or Ctrl + Shift + b
	// - 컴파일과 링커를 일괄처리

	// 실행 : Ctrl + F5
	// - start the program

}// main function end